{"id":"sec-ecmascript-overview","html":"\n    <div class=\"front\">\n      <h1><span class=\"secnum\" id=\"sec-4.2\"><a href=\"/sec/sec-ecmascript-overview.html\" title=\"link to this section\">4.2</a></span>\n          ECMAScript Overview</h1>\n\n      <p>The following is an informal overview of ECMAScript&#x2014;not all parts of the language are described. This overview is\n      not part of the standard proper.</p>\n\n      <p>ECMAScript is object-based: basic language and host facilities are provided by objects, and an ECMAScript program is a\n      cluster of communicating objects. In ECMAScript, an <b><i>object</i></b> is a collection of zero or more\n      <b><i>properties</i></b> each with <b><i>attributes</i></b> that determine how each property can be used&#x2014;for example,\n      when the Writable attribute for a property is set to <b>false</b>, any attempt by executed ECMAScript code to assign a\n      different value to the property fails. Properties are containers that hold other objects, <b><i>primitive values</i></b>, or\n      <b><i>functions</i></b>. A primitive value is a member of one of the following built-in types: <b>Undefined</b>,\n      <b>Null</b>, <b>Boolean</b>, <b>Number</b>, <b>String,</b> and <b>Symbol;</b> an object is a member of the built-in type\n      <b>Object</b>; and a function is a callable object. A function that is associated with an object via a property is called a\n      <b><i>method</i></b>.</p>\n\n      <p>ECMAScript defines a collection of <b><i>built-in objects</i></b> that round out the definition of ECMAScript entities.\n      These built-in objects include the global object; objects that are fundamental to the runtime semantics of the language\n      including <b>Object</b>, <b>Function</b>, <b>Boolean</b>, <b>Symbol</b>, and various <b>Error</b> objects; objects that\n      represent and manipulate numeric values including <b>Math</b>, <b>Number</b>, and <b>Date</b>; the text processing objects\n      <b>String</b> and <b>RegExp</b>; objects that are indexed collections of values including <b>Array</b> and nine different\n      kinds of Typed Arrays whose elements all have a specific numeric data representation; keyed collections including <b>Map</b>\n      and <b>Set</b> objects; objects supporting structured data including the <b>JSON</b> object, <b>ArrayBuffer</b>, and\n      <b>DataView</b>; objects supporting control abstractions including generator functions and <b>Promise</b> objects;\n      and<b>,</b> reflection objects including <b>Proxy</b> and <b>Reflect</b>.</p>\n\n      <p>ECMAScript also defines a set of built-in <b><i>operators</i></b>. ECMAScript operators include various unary operations,\n      multiplicative operators, additive operators, bitwise shift operators, relational operators, equality operators, binary\n      bitwise operators, binary logical operators, assignment operators, and the comma operator.</p>\n\n      <p>Large ECMAScript programs are supported by <b><i>modules</i></b> which allow a program to be divided into multiple\n      sequences of statements and declarations. Each module explicitly identifies declarations it uses that need to be provided by\n      other modules and which of its declarations are available for use by other modules.</p>\n\n      <p>ECMAScript syntax intentionally resembles Java syntax. ECMAScript syntax is relaxed to enable it to serve as an\n      easy-to-use scripting language. For example, a variable is not required to have its type declared nor are types associated\n      with properties, and defined functions are not required to have their declarations appear textually before calls to\n      them.</p>\n    </div>\n\n    <section id=\"sec-objects\">\n      <h1><span class=\"secnum\" id=\"sec-4.2.1\"><a href=\"/sec/sec-objects.html\" title=\"link to this section\">4.2.1</a></span> Objects</h1>\n\n      <p>Even though ECMAScript includes syntax for class definitions, ECMAScript objects are not fundamentally class-based such\n      as those in C++, Smalltalk, or Java. Instead objects may be created in various ways including via a literal notation or via\n      <b><i>constructors</i></b> which create objects and then execute code that initializes all or part of them by assigning\n      initial values to their properties.  Each constructor is a function that has a property named <code>&quot;prototype&quot;</code> that\n      is used to implement <b><i>prototype-based inheritance</i></b> and <b><i>shared properties</i></b>. Objects are created by\n      using constructors in <b>new</b> expressions; for example, <code>new Date(2009,11)</code> creates a new Date object.\n      Invoking a constructor without using <b>new</b> has consequences that depend on the constructor. For example,\n      <code>Date()</code> produces a string representation of the current date and time rather than an object.</p>\n\n      <p>Every object created by a constructor has an implicit reference (called the object&#x2019;s <i>prototype</i>) to the value\n      of its constructor&#x2019;s <code>&quot;prototype&quot;</code> property. Furthermore, a prototype may have a non-null implicit\n      reference to its prototype, and so on; this is called the <i>prototype chain</i>. When a reference is made to a property in\n      an object, that reference is to the property of that name in the first object in the prototype chain that contains a\n      property of that name. In other words, first the object mentioned directly is examined for such a property; if that object\n      contains the named property, that is the property to which the reference refers; if that object does not contain the named\n      property, the prototype for that object is examined next; and so on.</p>\n\n      <figure>\n        <object data=\"figure-1.svg\" height=\"354\" type=\"image/svg+xml\" width=\"719\">\n          <img alt=\"An image of lots of boxes and arrows.\" height=\"354\" src=\"figure-1.png\" width=\"719\">\n        </object>\n        <figcaption>Figure 1 &#x2014; Object/Prototype Relationships</figcaption>\n      </figure>\n\n      <p>In a class-based object-oriented language, in general, state is carried by instances, methods are carried by classes, and\n      inheritance is only of structure and behaviour. In ECMAScript, the state and methods are carried by objects, while\n      structure, behaviour, and state are all inherited.</p>\n\n      <p>All objects that do not directly contain a particular property that their prototype contains share that property and its\n      value. Figure 1 illustrates this:</p>\n\n      <p><b>CF</b> is a constructor (and also an object). Five objects have been created by using <code>new</code> expressions:\n      <b>cf<sub>1</sub></b>, <b>cf<sub>2</sub></b>, <b>cf<sub>3</sub></b>, <b>cf<sub>4</sub></b>, and <b>cf<sub>5</sub></b>. Each\n      of these objects contains properties named <code>q1</code> and <code>q2</code>. The dashed lines represent the implicit\n      prototype relationship; so, for example, <b>cf<sub>3</sub></b>&#x2019;s prototype is <b>CF<sub>p</sub></b>. The constructor,\n      <b>CF</b>, has two properties itself, named <code>P1</code> and <code>P2</code>, which are not visible to\n      <b>CF<sub>p</sub></b>, <b>cf<sub>1</sub></b>, <b>cf<sub>2</sub></b>, <b>cf<sub>3</sub></b>, <b>cf<sub>4</sub></b>, or\n      <b>cf<sub>5</sub></b>. The property named <code>CFP1</code> in <b>CF<sub>p</sub></b> is shared by <b>cf<sub>1</sub></b>,\n      <b>cf<sub>2</sub></b>, <b>cf<sub>3</sub></b>, <b>cf<sub>4</sub></b>, and <b>cf<sub>5</sub></b> (but not by <b>CF</b>), as\n      are any properties found in <b>CF<sub>p</sub></b>&#x2019;s implicit prototype chain that are not named <code>q1</code>,\n      <code>q2</code>, or <code>CFP1</code>. Notice that there is no implicit prototype link between <b>CF</b> and\n      <b>CF<sub>p</sub></b>.</p>\n\n      <p>Unlike most class-based object languages, properties can be added to objects dynamically by assigning values to them.\n      That is, constructors are not required to name or assign values to all or any of the constructed object&#x2019;s properties.\n      In the above diagram, one could add a new shared property for <b>cf<sub>1</sub></b>, <b>cf<sub>2</sub></b>,\n      <b>cf<sub>3</sub></b>, <b>cf<sub>4</sub></b>, and <b>cf<sub>5</sub></b> by assigning a new value to the property in\n      <b>CF<sub>p</sub></b>.</p>\n\n      <p>Although ECMAScript objects are not inherently class-based, it is often convenient to define class-like abstractions\n      based upon a common pattern of constructor functions, prototype objects, and methods. The ECMAScript built-in objects\n      themselves follow such a class-like pattern. Beginning with ECMAScript 2015, the ECMAScript language includes syntactic\n      class definitions that permit programmers to concisely define objects that conform to the same class-like abstraction\n      pattern used by the built-in objects.</p>\n    </section>\n\n    <section id=\"sec-strict-variant-of-ecmascript\">\n      <h1><span class=\"secnum\" id=\"sec-4.2.2\"><a href=\"/sec/sec-strict-variant-of-ecmascript.html\" title=\"link to this section\">4.2.2</a></span> The Strict Variant of ECMAScript</h1>\n\n      <p>The ECMAScript Language recognizes the possibility that some users of the language may wish to restrict their usage of\n      some features available in the language. They might do so in the interests of security, to avoid what they consider to be\n      error-prone features, to get enhanced error checking, or for other reasons of their choosing. In support of this\n      possibility, ECMAScript defines a strict variant of the language. The strict variant of the language excludes some specific\n      syntactic and semantic features of the regular ECMAScript language and modifies the detailed semantics of some features. The\n      strict variant also specifies additional error conditions that must be reported by throwing error exceptions in situations\n      that are not specified as errors by the non-strict form of the language.</p>\n\n      <p>The strict variant of ECMAScript is commonly referred to as the <i>strict mode</i> of the language. Strict mode selection\n      and use of the strict mode syntax and semantics of ECMAScript is explicitly made at the level of individual ECMAScript\n      source text units. Because strict mode is selected at the level of a syntactic source text unit, strict mode only imposes\n      restrictions that have local effect within such a source text unit. Strict mode does not restrict or modify any aspect of\n      the ECMAScript semantics that must operate consistently across multiple source text units. A complete ECMAScript program may\n      be composed of both strict mode and non-strict mode ECMAScript source text units. In this case, strict mode only applies\n      when actually executing code that is defined within a strict mode source text unit.</p>\n\n      <p>In order to conform to this specification, an ECMAScript implementation must implement both the full unrestricted\n      ECMAScript language and the strict variant of the ECMAScript language as defined by this specification. In addition, an\n      implementation must support the combination of unrestricted and strict mode source text units into a single composite\n      program.</p>\n    </section>\n  "}