{"id":"sec-static-semantic-rules","html":"\n    <h1><span class=\"secnum\" id=\"sec-5.3\"><a href=\"/sec/sec-static-semantic-rules.html\" title=\"link to this section\">5.3</a></span> Static\n        Semantic Rules</h1>\n\n    <p>Context-free grammars are not sufficiently powerful to express all the rules that define whether a stream of input elements\n    form a valid ECMAScript <span class=\"nt\">Script</span> or <span class=\"nt\">Module</span> that may be evaluated. In some\n    situations additional rules are needed that may be expressed using either ECMAScript algorithm conventions or prose\n    requirements. Such rules are always associated with a production of a grammar and are called the <i>static semantics</i> of\n    the production.</p>\n\n    <p>Static Semantic Rules have names and typically are defined using an algorithm. Named Static Semantic Rules are associated\n    with grammar productions and a production that has multiple alternative definitions will typically have for each alternative a\n    distinct algorithm for each applicable named static semantic rule.</p>\n\n    <p class=\"normalbefore\">Unless otherwise specified every grammar production alternative in this specification implicitly has a\n    definition for a static semantic rule named <span style=\"font-family: Times New Roman\">Contains</span> which takes an argument\n    named <var>symbol</var> whose value is a terminal or nonterminal of the grammar that includes the associated production. The\n    default definition of <span style=\"font-family: Times New Roman\">Contains</span> is:</p>\n\n    <ol class=\"proc\">\n      <li>For each terminal and nonterminal grammar symbol, <i>sym</i>,  in the definition of this production do\n        <ol class=\"block\">\n          <li>If <i>sym</i> is the same grammar symbol as <i>symbol</i>, return <b>true</b>.</li>\n          <li>If <i>sym</i> is a nonterminal, then\n            <ol class=\"block\">\n              <li>Let <i>contained</i> be the result of <i>sym</i> Contains <i>symbol</i>.</li>\n              <li>If <i>contained</i> is <b>true</b>, return <b>true</b>.</li>\n            </ol>\n          </li>\n        </ol>\n      </li>\n      <li>Return <b>false</b>.</li>\n    </ol>\n\n    <p>The above definition is explicitly over-ridden for specific productions.</p>\n\n    <p>A special kind of static semantic rule is an Early Error Rule. Early error rules define early error conditions (see <a href=\"/sec/sec-error-handling-and-language-extensions.html\">clause 16</a>) that are associated with specific grammar productions.\n    Evaluation of most early error rules are not explicitly invoked within the algorithms of this specification. A conforming\n    implementation must, prior to the first evaluation of a <span style=\"font-family: Times New Roman\"><i>Script</i></span> or\n    <span style=\"font-family: Times New Roman\"><i>Module</i></span>, validate all of the early error rules of the productions used to parse that <span style=\"font-family:\n    Times New Roman\"><i>Script</i></span> or <span style=\"font-family: Times New Roman\"><i>Module</i></span>. If any of the early error rules are violated the <span style=\"font-family: Times New Roman\"><i>Script</i></span> or <span style=\"font-family: Times New Roman\"><i>Module</i></span> is invalid and cannot be evaluated.</p>\n  "}