{"id":"sec-objects","html":"\n      <h1><span class=\"secnum\" id=\"sec-4.2.1\"><a href=\"/sec/sec-objects.html\" title=\"link to this section\">4.2.1</a></span> Objects</h1>\n\n      <p>Even though ECMAScript includes syntax for class definitions, ECMAScript objects are not fundamentally class-based such\n      as those in C++, Smalltalk, or Java. Instead objects may be created in various ways including via a literal notation or via\n      <b><i>constructors</i></b> which create objects and then execute code that initializes all or part of them by assigning\n      initial values to their properties.  Each constructor is a function that has a property named <code>&quot;prototype&quot;</code> that\n      is used to implement <b><i>prototype-based inheritance</i></b> and <b><i>shared properties</i></b>. Objects are created by\n      using constructors in <b>new</b> expressions; for example, <code>new Date(2009,11)</code> creates a new Date object.\n      Invoking a constructor without using <b>new</b> has consequences that depend on the constructor. For example,\n      <code>Date()</code> produces a string representation of the current date and time rather than an object.</p>\n\n      <p>Every object created by a constructor has an implicit reference (called the object&#x2019;s <i>prototype</i>) to the value\n      of its constructor&#x2019;s <code>&quot;prototype&quot;</code> property. Furthermore, a prototype may have a non-null implicit\n      reference to its prototype, and so on; this is called the <i>prototype chain</i>. When a reference is made to a property in\n      an object, that reference is to the property of that name in the first object in the prototype chain that contains a\n      property of that name. In other words, first the object mentioned directly is examined for such a property; if that object\n      contains the named property, that is the property to which the reference refers; if that object does not contain the named\n      property, the prototype for that object is examined next; and so on.</p>\n\n      <figure>\n        <object data=\"figure-1.svg\" height=\"354\" type=\"image/svg+xml\" width=\"719\">\n          <img alt=\"An image of lots of boxes and arrows.\" height=\"354\" src=\"figure-1.png\" width=\"719\">\n        </object>\n        <figcaption>Figure 1 &#x2014; Object/Prototype Relationships</figcaption>\n      </figure>\n\n      <p>In a class-based object-oriented language, in general, state is carried by instances, methods are carried by classes, and\n      inheritance is only of structure and behaviour. In ECMAScript, the state and methods are carried by objects, while\n      structure, behaviour, and state are all inherited.</p>\n\n      <p>All objects that do not directly contain a particular property that their prototype contains share that property and its\n      value. Figure 1 illustrates this:</p>\n\n      <p><b>CF</b> is a constructor (and also an object). Five objects have been created by using <code>new</code> expressions:\n      <b>cf<sub>1</sub></b>, <b>cf<sub>2</sub></b>, <b>cf<sub>3</sub></b>, <b>cf<sub>4</sub></b>, and <b>cf<sub>5</sub></b>. Each\n      of these objects contains properties named <code>q1</code> and <code>q2</code>. The dashed lines represent the implicit\n      prototype relationship; so, for example, <b>cf<sub>3</sub></b>&#x2019;s prototype is <b>CF<sub>p</sub></b>. The constructor,\n      <b>CF</b>, has two properties itself, named <code>P1</code> and <code>P2</code>, which are not visible to\n      <b>CF<sub>p</sub></b>, <b>cf<sub>1</sub></b>, <b>cf<sub>2</sub></b>, <b>cf<sub>3</sub></b>, <b>cf<sub>4</sub></b>, or\n      <b>cf<sub>5</sub></b>. The property named <code>CFP1</code> in <b>CF<sub>p</sub></b> is shared by <b>cf<sub>1</sub></b>,\n      <b>cf<sub>2</sub></b>, <b>cf<sub>3</sub></b>, <b>cf<sub>4</sub></b>, and <b>cf<sub>5</sub></b> (but not by <b>CF</b>), as\n      are any properties found in <b>CF<sub>p</sub></b>&#x2019;s implicit prototype chain that are not named <code>q1</code>,\n      <code>q2</code>, or <code>CFP1</code>. Notice that there is no implicit prototype link between <b>CF</b> and\n      <b>CF<sub>p</sub></b>.</p>\n\n      <p>Unlike most class-based object languages, properties can be added to objects dynamically by assigning values to them.\n      That is, constructors are not required to name or assign values to all or any of the constructed object&#x2019;s properties.\n      In the above diagram, one could add a new shared property for <b>cf<sub>1</sub></b>, <b>cf<sub>2</sub></b>,\n      <b>cf<sub>3</sub></b>, <b>cf<sub>4</sub></b>, and <b>cf<sub>5</sub></b> by assigning a new value to the property in\n      <b>CF<sub>p</sub></b>.</p>\n\n      <p>Although ECMAScript objects are not inherently class-based, it is often convenient to define class-like abstractions\n      based upon a common pattern of constructor functions, prototype objects, and methods. The ECMAScript built-in objects\n      themselves follow such a class-like pattern. Beginning with ECMAScript 2015, the ECMAScript language includes syntactic\n      class definitions that permit programmers to concisely define objects that conform to the same class-like abstraction\n      pattern used by the built-in objects.</p>\n    "}