{"id":"sec-strict-variant-of-ecmascript","html":"\n      <h1><span class=\"secnum\" id=\"sec-4.2.2\"><a href=\"/sec/sec-strict-variant-of-ecmascript.html\" title=\"link to this section\">4.2.2</a></span> The Strict Variant of ECMAScript</h1>\n\n      <p>The ECMAScript Language recognizes the possibility that some users of the language may wish to restrict their usage of\n      some features available in the language. They might do so in the interests of security, to avoid what they consider to be\n      error-prone features, to get enhanced error checking, or for other reasons of their choosing. In support of this\n      possibility, ECMAScript defines a strict variant of the language. The strict variant of the language excludes some specific\n      syntactic and semantic features of the regular ECMAScript language and modifies the detailed semantics of some features. The\n      strict variant also specifies additional error conditions that must be reported by throwing error exceptions in situations\n      that are not specified as errors by the non-strict form of the language.</p>\n\n      <p>The strict variant of ECMAScript is commonly referred to as the <i>strict mode</i> of the language. Strict mode selection\n      and use of the strict mode syntax and semantics of ECMAScript is explicitly made at the level of individual ECMAScript\n      source text units. Because strict mode is selected at the level of a syntactic source text unit, strict mode only imposes\n      restrictions that have local effect within such a source text unit. Strict mode does not restrict or modify any aspect of\n      the ECMAScript semantics that must operate consistently across multiple source text units. A complete ECMAScript program may\n      be composed of both strict mode and non-strict mode ECMAScript source text units. In this case, strict mode only applies\n      when actually executing code that is defined within a strict mode source text unit.</p>\n\n      <p>In order to conform to this specification, an ECMAScript implementation must implement both the full unrestricted\n      ECMAScript language and the strict variant of the ECMAScript language as defined by this specification. In addition, an\n      implementation must support the combination of unrestricted and strict mode source text units into a single composite\n      program.</p>\n    "}