{"id":"sec-source-text","html":"\n    <div class=\"front\">\n      <h1><span class=\"secnum\" id=\"sec-10.1\"><a href=\"/sec/sec-source-text.html\" title=\"link to this section\">10.1</a></span> Source\n          Text</h1>\n      <h2>Syntax</h2>\n\n      <div class=\"gp\">\n        <div class=\"lhs\"><span class=\"nt\">SourceCharacter</span> <span class=\"geq\">::</span></div>\n        <div class=\"rhs\"><span class=\"gprose\">any Unicode code point</span></div>\n      </div>\n\n      <p>ECMAScript code is expressed using Unicode, version 5.1 or later. ECMAScript source text is a sequence of code points.\n      All Unicode code point values from U+0000 to U+10FFFF, including surrogate code points, may occur in source text where\n      permitted by the ECMAScript grammars. The actual encodings used to store and interchange ECMAScript source text is not\n      relevant to this specification. Regardless of the external source text encoding, a conforming ECMAScript implementation\n      processes the source text as if it was an equivalent sequence of <span class=\"nt\">SourceCharacter</span> values. Each <span class=\"nt\">SourceCharacter</span> being a Unicode code point. Conforming ECMAScript implementations are not required to\n      perform any normalization of source text, or behave as though they were performing normalization of source text.</p>\n\n      <p>The components of a combining character sequence are treated as individual Unicode code points even though a user might\n      think of the whole sequence as a single character.</p>\n\n      <div class=\"note\">\n        <p><span class=\"nh\">NOTE</span> In string literals, regular expression literals, template literals and identifiers, any\n        Unicode code point may also be expressed using Unicode escape sequences that explicitly express a code point&#x2019;s\n        numeric value. Within a comment, such an escape sequence is effectively ignored as part of the comment.</p>\n\n        <p>ECMAScript differs from the Java programming language in the behaviour of Unicode escape sequences. In a Java program,\n        if the Unicode escape sequence <code>\\u000A</code>, for example, occurs within a single-line comment, it is interpreted as\n        a line terminator (Unicode code point U+000A is LINE FEED (LF) and therefore the next code point is not part of the\n        comment. Similarly, if the Unicode escape sequence <code>\\u000A</code> occurs within a string literal in a Java program,\n        it is likewise interpreted as a line terminator, which is not allowed within a string literal&#x2014;one must write\n        <code>\\n</code> instead of <code>\\u000A</code> to cause a LINE FEED (LF) to be part of the String value of a string\n        literal. In an ECMAScript program, a Unicode escape sequence occurring within a comment is never interpreted and therefore\n        cannot contribute to termination of the comment. Similarly, a Unicode escape sequence occurring within a string literal in\n        an ECMAScript program always contributes to the literal and is never interpreted as a line terminator or as a code point\n        that might terminate the string literal.</p>\n      </div>\n    </div>\n\n    <section id=\"sec-utf16encoding\">\n      <h1><span class=\"secnum\" id=\"sec-10.1.1\"><a href=\"/sec/sec-utf16encoding.html\" title=\"link to this section\">10.1.1</a></span> Static\n          Semantics:  <var>UTF16Encoding ( cp )</var></h1>\n\n      <p>The UTF16Encoding of a numeric code point value, <var>cp</var>, is determined as follows:</p>\n\n      <ol class=\"proc\">\n        <li><a href=\"/sec/sec-algorithm-conventions.html\">Assert</a>: 0 &#x2264; <i>cp</i> &#x2264; 0x10FFFF.</li>\n        <li>If <i>cp</i> &#x2264; 65535, return <i>cp</i>.</li>\n        <li>Let <i>cu1</i> be <a href=\"/sec/sec-algorithm-conventions.html\">floor</a>((<i>cp</i> &#x2013; 65536) / 1024) + 0xD800.</li>\n        <li>Let <i>cu2</i> be ((<i>cp</i> &#x2013; 65536) <a href=\"/sec/sec-algorithm-conventions.html\">modulo</a> 1024) + 0xDC00.</li>\n        <li>Return the code unit sequence consisting of <i>cu1</i> followed by <i>cu2</i>.</li>\n      </ol>\n    </section>\n\n    <section id=\"sec-utf16decode\">\n      <h1><span class=\"secnum\" id=\"sec-10.1.2\"><a href=\"/sec/sec-utf16decode.html\" title=\"link to this section\">10.1.2</a></span> Static\n          Semantics: UTF16Decode( lead, trail )</h1>\n\n      <p>Two code units, <var>lead</var> and <var>trail</var>, that form a UTF-16 surrogate pair are converted to a code point by\n      performing the following steps:</p>\n\n      <ol class=\"proc\">\n        <li><a href=\"/sec/sec-algorithm-conventions.html\">Assert</a>: 0xD800 &#x2264; <i>lead</i> &#x2264; 0xDBFF and 0xDC00 &#x2264; <i>trail</i> &#x2264;\n            0xDFFF.</li>\n        <li>Let <i>cp</i> be (<i>lead</i> &#x2013; 0xD800) &#xD7; 1024 + (<i>trail</i> &#x2013; 0xDC00) + 0x10000.</li>\n        <li>Return the code point <i>cp</i>.</li>\n      </ol>\n    </section>\n  "}