{"id":"sec-lexical-and-regexp-grammars","html":"\n      <h1><span class=\"secnum\" id=\"sec-5.1.2\"><a href=\"/sec/sec-lexical-and-regexp-grammars.html\" title=\"link to this section\">5.1.2</a></span> The Lexical and RegExp Grammars</h1>\n\n      <p>A <i>lexical grammar</i> for ECMAScript is given in <a href=\"/sec/sec-ecmascript-language-lexical-grammar.html\">clause 11</a>.\n      This grammar has as its terminal symbols Unicode code points that conform to the rules for <span class=\"nt\">SourceCharacter</span> defined in <a href=\"/sec/sec-source-text.html\">10.1</a>. It defines a set of productions, starting\n      from the goal symbol <var>InputElementDiv,</var> <var>InputElementTemplateTail,</var> or <span class=\"nt\">InputElementRegExp</span>, or <var>InputElementRegExpOrTemplateTail,</var> that describe how sequences of such\n      code points are translated into a sequence of input elements.</p>\n\n      <p>Input elements other than white space and comments form the terminal symbols for the syntactic grammar for ECMAScript and\n      are called ECMAScript <i>tokens</i>. These tokens are the reserved words, identifiers, literals, and punctuators of the\n      ECMAScript language. Moreover, line terminators, although not considered to be tokens, also become part of the stream of\n      input elements and guide the process of <a href=\"/sec/sec-automatic-semicolon-insertion.html\">automatic semicolon insertion</a> (<a href=\"/sec/sec-automatic-semicolon-insertion.html\">11.9</a>). Simple white space and single-line comments are discarded and do not\n      appear in the stream of input elements for the syntactic grammar. A <span class=\"nt\">MultiLineComment</span> (that is, a\n      comment of the form <code>/*</code>&#x2026;<code>*/</code> regardless of whether it spans more than one line) is likewise\n      simply discarded if it contains no line terminator; but if a <span class=\"nt\">MultiLineComment</span> contains one or more\n      line terminators, then it is replaced by a single line terminator, which becomes part of the stream of input elements for\n      the syntactic grammar.</p>\n\n      <p>A <i>RegExp grammar</i> for ECMAScript is given in <a href=\"/sec/sec-patterns.html\">21.2.1</a>. This grammar also has as its\n      terminal symbols the code points as defined by <span class=\"nt\">SourceCharacter</span>. It defines a set of productions,\n      starting from the goal symbol <span class=\"nt\">Pattern</span>, that describe how sequences of code points are translated\n      into regular expression patterns.</p>\n\n      <p>Productions of the lexical and RegExp grammars are distinguished by having two colons &#x201C;<b>::</b>&#x201D; as\n      separating punctuation. The lexical and RegExp grammars share some productions.</p>\n    "}