{"id":"sec-applying-the-mod-operator","html":"\n        <h1><span class=\"secnum\" id=\"sec-12.6.3.3\"><a href=\"/sec/sec-applying-the-mod-operator.html\" title=\"link to this section\">12.6.3.3</a></span> Applying the <code>%</code> Operator</h1>\n\n        <p>The <code>%</code> <span class=\"nt\">MultiplicativeOperator</span> yields the remainder of its operands from an implied\n        division; the left operand is the dividend and the right operand is the divisor.</p>\n\n        <div class=\"note\">\n          <p><span class=\"nh\">NOTE</span> In C and C++, the remainder operator accepts only integral operands; in ECMAScript, it\n          also accepts floating-point operands.</p>\n        </div>\n\n        <p>The result of a floating-point remainder operation as computed by the <code>%</code> operator is not the same as the\n        &#x201C;remainder&#x201D; operation defined by IEEE 754-2008. The IEEE 754-2008 &#x201C;remainder&#x201D; operation computes\n        the remainder from a rounding division, not a truncating division, and so its behaviour is not analogous to that of the\n        usual integer remainder operator. Instead the ECMAScript language defines <code>%</code> on floating-point operations to\n        behave in a manner analogous to that of the Java integer remainder operator; this may be compared with the C library\n        function fmod.</p>\n\n        <p>The result of an ECMAScript floating-point remainder operation is determined by the rules of IEEE arithmetic:</p>\n\n        <ul>\n          <li>\n            <p>If either operand is <b>NaN</b>, the result is <b>NaN</b>.</p>\n          </li>\n\n          <li>\n            <p>The sign of the result equals the sign of the dividend.</p>\n          </li>\n\n          <li>\n            <p>If the dividend is an infinity, or the divisor is a zero, or both, the result is <b>NaN</b>.</p>\n          </li>\n\n          <li>\n            <p>If the dividend is finite and the divisor is an infinity, the result equals the dividend.</p>\n          </li>\n\n          <li>\n            <p>If the dividend is a zero and the divisor is nonzero and finite, the result is the same as the dividend.</p>\n          </li>\n\n          <li>\n            <p>In the remaining cases, where neither an infinity, nor a zero, nor <b>NaN</b> is involved, the floating-point\n            remainder r from a dividend n and a divisor d is defined by the mathematical relation r = n &#x2212; (d &#xD7; q)\n            where q is an integer that is negative only if n/d is negative and positive only if n/d is positive, and whose\n            magnitude is as large as possible without exceeding the magnitude of the true mathematical quotient of n and d. r is\n            computed and rounded to the nearest representable value using IEEE 754-2008 round-to-nearest mode.</p>\n          </li>\n        </ul>\n      "}